   Layer (type)         Input Shape          Output Shape         Param #
===============================================================================
     Conv2D-1        [[144, 3, 64, 64]]   [144, 64, 64, 64]        1,792
   BatchNorm2D-1    [[144, 64, 64, 64]]   [144, 64, 64, 64]         256
1_1      ReLU-1        [[144, 64, 64, 64]]   [144, 64, 64, 64]          0
     Conv2D-2       [[144, 64, 64, 64]]   [144, 64, 64, 64]       36,928
   BatchNorm2D-2    [[144, 64, 64, 64]]   [144, 64, 64, 64]         256
1_2      ReLU-2        [[144, 64, 64, 64]]   [144, 64, 64, 64]          0
    MaxPool2D-1     [[144, 64, 64, 64]]   [144, 64, 32, 32]          0
     Conv2D-3       [[144, 64, 32, 32]]   [144, 128, 32, 32]      73,856
   BatchNorm2D-3    [[144, 128, 32, 32]]  [144, 128, 32, 32]        512
2_1      ReLU-3        [[144, 128, 32, 32]]  [144, 128, 32, 32]         0
     Conv2D-4       [[144, 128, 32, 32]]  [144, 128, 32, 32]      147,584
   BatchNorm2D-4    [[144, 128, 32, 32]]  [144, 128, 32, 32]        512
2_2      ReLU-4        [[144, 128, 32, 32]]  [144, 128, 32, 32]         0
    MaxPool2D-2     [[144, 128, 32, 32]]  [144, 128, 16, 16]         0
     Conv2D-5       [[144, 128, 16, 16]]  [144, 256, 16, 16]      295,168
   BatchNorm2D-5    [[144, 256, 16, 16]]  [144, 256, 16, 16]       1,024
3_1  16    ReLU-5        [[144, 256, 16, 16]]  [144, 256, 16, 16]         0
     Conv2D-6       [[144, 256, 16, 16]]  [144, 256, 16, 16]      590,080
   BatchNorm2D-6    [[144, 256, 16, 16]]  [144, 256, 16, 16]       1,024
3_2      ReLU-6        [[144, 256, 16, 16]]  [144, 256, 16, 16]         0
     Conv2D-7       [[144, 256, 16, 16]]  [144, 256, 16, 16]      590,080
   BatchNorm2D-7    [[144, 256, 16, 16]]  [144, 256, 16, 16]       1,024
3_3      ReLU-7        [[144, 256, 16, 16]]  [144, 256, 16, 16]         0
     Conv2D-8       [[144, 256, 16, 16]]  [144, 256, 16, 16]      590,080
   BatchNorm2D-8    [[144, 256, 16, 16]]  [144, 256, 16, 16]       1,024
3_4      ReLU-8        [[144, 256, 16, 16]]  [144, 256, 16, 16]         0
    MaxPool2D-3     [[144, 256, 16, 16]]   [144, 256, 8, 8]          0
     Conv2D-9        [[144, 256, 8, 8]]    [144, 512, 8, 8]      1,180,160
   BatchNorm2D-9     [[144, 512, 8, 8]]    [144, 512, 8, 8]        2,048
4_1  29    ReLU-9         [[144, 512, 8, 8]]    [144, 512, 8, 8]          0
     Conv2D-10       [[144, 512, 8, 8]]    [144, 512, 8, 8]      2,359,808
  BatchNorm2D-10     [[144, 512, 8, 8]]    [144, 512, 8, 8]        2,048
4_2      ReLU-10        [[144, 512, 8, 8]]    [144, 512, 8, 8]          0
     Conv2D-11       [[144, 512, 8, 8]]    [144, 512, 8, 8]      2,359,808
  BatchNorm2D-11     [[144, 512, 8, 8]]    [144, 512, 8, 8]        2,048
4_3      ReLU-11        [[144, 512, 8, 8]]    [144, 512, 8, 8]          0
     Conv2D-12       [[144, 512, 8, 8]]    [144, 512, 8, 8]      2,359,808
  BatchNorm2D-12     [[144, 512, 8, 8]]    [144, 512, 8, 8]        2,048
4_4      ReLU-12        [[144, 512, 8, 8]]    [144, 512, 8, 8]          0
    MaxPool2D-4      [[144, 512, 8, 8]]    [144, 512, 4, 4]          0
     Conv2D-13       [[144, 512, 4, 4]]    [144, 512, 4, 4]      2,359,808
  BatchNorm2D-13     [[144, 512, 4, 4]]    [144, 512, 4, 4]        2,048
5_1 42     ReLU-13        [[144, 512, 4, 4]]    [144, 512, 4, 4]          0
     Conv2D-14       [[144, 512, 4, 4]]    [144, 512, 4, 4]      2,359,808
  BatchNorm2D-14     [[144, 512, 4, 4]]    [144, 512, 4, 4]        2,048
5_2      ReLU-14        [[144, 512, 4, 4]]    [144, 512, 4, 4]          0
     Conv2D-15       [[144, 512, 4, 4]]    [144, 512, 4, 4]      2,359,808
  BatchNorm2D-15     [[144, 512, 4, 4]]    [144, 512, 4, 4]        2,048
5_3      ReLU-15        [[144, 512, 4, 4]]    [144, 512, 4, 4]          0
     Conv2D-16       [[144, 512, 4, 4]]    [144, 512, 4, 4]      2,359,808
  BatchNorm2D-16     [[144, 512, 4, 4]]    [144, 512, 4, 4]        2,048
5_4      ReLU-16        [[144, 512, 4, 4]]    [144, 512, 4, 4]          0
    MaxPool2D-5      [[144, 512, 4, 4]]    [144, 512, 2, 2]          0
AdaptiveAvgPool2D-1  [[144, 512, 2, 2]]    [144, 512, 7, 7]          0
     Linear-1          [[144, 25088]]        [144, 4096]        102,764,544
      ReLU-17          [[144, 4096]]         [144, 4096]             0
     Dropout-1         [[144, 4096]]         [144, 4096]             0
     Linear-2          [[144, 4096]]         [144, 4096]        16,781,312
      ReLU-18          [[144, 4096]]         [144, 4096]             0
     Dropout-2         [[144, 4096]]         [144, 4096]             0
     Linear-3          [[144, 4096]]         [144, 1000]         4,097,000